books_dict = { "Голодні ігри": {"автор": "Сюзанна Колінз", "рік видання": 2008, "кількість сторінок": 352},
               "Таємниці пенсіону": {"автор": "Аґата Крісті", "рік видання": 1955, "кількість сторінок": 320},
               "Бріджертони. Герцог і я. ": {"автор": "Джулія Квінн", "рік видання": 2000, "кількість сторінок": 496},
               "Дім дивних дітей": {"автор": "Ренсом Ріггз", "рік видання": 2011, "кількість сторінок": 432},
               "Втрачений рай": {"автор": "Джон Мільтон", "рік видання": 1667, "кількість сторінок": 480},
               "Шістка воронів": {"автор": "Лі Бардуґо", "рік видання": 2015, "кількість сторінок": 544},
               "Місто кісток": {"автор": "Кассандра Клер", "рік видання": 2007, "кількість сторінок": 528},
               "Timeless.Рубінова книга": {"автор": "Керстін Гір", "рік видання": 2009, "кількість сторінок": 304},
               }

book_name = input("Введіть назву книги: ")

if book_name in books_dict.keys():
    print("Інформація про книгу: ")
    print("Назва: ", book_name)
    print("Автор: ", books_dict[book_name] ["автор"])
    print("Рік видання: ", books_dict[book_name]["рік видання"])
    print("Кількість сторінок: ", books_dict[book_name] ["кількість сторінок"])
else:
    print("Книга не знайдена в бібліотеці.")